Revit 2027 API
ParameterTypeId.ViewSolarstudyShadowsIntensityText Property
 "Shadows intensity text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyShadowsIntensityText { get; }
Public Shared ReadOnly Property ViewSolarstudyShadowsIntensityText As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyShadowsIntensityText {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyShadowsIntensityText : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace